In [56]:
import pandas as pd;

In [57]:
data = {
    'name':['vishal', 'om', 'shubz'],
    'age':[22,33,44], 
    'department':['IT', 'CS', 'Ai-ML']
}

df = pd.DataFrame(data)

In [58]:
df

     name  age department
0  vishal   22         IT
1      om   33         CS
2   shubz   44      Ai-ML

In [59]:
df['salary'] = [23455,22222,55533]

In [68]:
df

     name  age department  salary
0  vishal   22         IT   23455
1      om   33         CS   22222
2   shubz   44      Ai-ML   55533

In [69]:
df.drop('salary', axis=1)

     name  age department
0  vishal   22         IT
1      om   33         CS
2   shubz   44      Ai-ML

In [71]:
df.loc[len(df)] = ['mayur', 22, 'IT', 234433]

In [72]:
df

     name  age department  salary
0  vishal   22         IT   23455
1      om   33         CS   22222
2   shubz   44      Ai-ML   55533
3   mayur   22         IT  234433

In [77]:
df.drop(df[df.name == 'mayur'].index)

     name  age department  salary
0  vishal   22         IT   23455
1      om   33         CS   22222
2   shubz   44      Ai-ML   55533

In [78]:
df

     name  age department  salary
0  vishal   22         IT   23455
1      om   33         CS   22222
2   shubz   44      Ai-ML   55533
3   mayur   22         IT  234433

In [79]:
df['Roomnumber'] = [2,3,4,5]

In [80]:
df

     name  age department  salary  Roomnumber
0  vishal   22         IT   23455           2
1      om   33         CS   22222           3
2   shubz   44      Ai-ML   55533           4
3   mayur   22         IT  234433           5

In [81]:
df.drop('Roomnumber', axis=1)

     name  age department  salary
0  vishal   22         IT   23455
1      om   33         CS   22222
2   shubz   44      Ai-ML   55533
3   mayur   22         IT  234433

In [82]:
df

     name  age department  salary  Roomnumber
0  vishal   22         IT   23455           2
1      om   33         CS   22222           3
2   shubz   44      Ai-ML   55533           4
3   mayur   22         IT  234433           5

In [83]:
df.loc[len(df)] = ['addi', 33, 'cs', 344322, 4]

In [84]:
df

     name  age department  salary  Roomnumber
0  vishal   22         IT   23455           2
1      om   33         CS   22222           3
2   shubz   44      Ai-ML   55533           4
3   mayur   22         IT  234433           5
4    addi   33         cs  344322           4

In [85]:
df.drop(df[df.name == 'addi'].index)

     name  age department  salary  Roomnumber
0  vishal   22         IT   23455           2
1      om   33         CS   22222           3
2   shubz   44      Ai-ML   55533           4
3   mayur   22         IT  234433           5

In [86]:
df.loc[0, 'salary'] == 50000

np.False_

In [87]:
df

     name  age department  salary  Roomnumber
0  vishal   22         IT   23455           2
1      om   33         CS   22222           3
2   shubz   44      Ai-ML   55533           4
3   mayur   22         IT  234433           5
4    addi   33         cs  344322           4